Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartBadConnectionAlignmentWarning Property
 The connection invalid due to the connector are not aligned and/or this is a gap between the connectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartBadConnectionAlignmentWarning { get; }
Public Shared ReadOnly Property FabricationPartBadConnectionAlignmentWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartBadConnectionAlignmentWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartBadConnectionAlignmentWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace